my-app/server/artillery_tests/results/test2_foreignKeys/reviews_test_log.txt
Test run id: t8epc_3dxd3czr9a9bpqd7hb4447dhhf7d4_dzdh
Phase started: Testing Reviews (index: 0, duration: 20s) 19:59:46(-0400)

Phase completed: Testing Reviews (index: 0, duration: 20s) 20:00:06(-0400)

--------------------------------------
Metrics for period to: 19:59:50(-0400) (width: 2.207s)
--------------------------------------

http.request_rate: ............................................................. 10/sec
http.requests: ................................................................. 15
vusers.created: ................................................................ 15
vusers.created_by_name.Get meta: ............................................... 3
vusers.created_by_name.Get reviews: ............................................ 6
vusers.created_by_name.Get reviews for a product: .............................. 6


Warning: multiple batches of metrics for period 1689724780000 2023-07-18T23:59:40.000Z
--------------------------------------
Metrics for period to: 20:00:00(-0400) (width: 9.224s)
--------------------------------------

errors.ETIMEDOUT: .............................................................. 10
http.codes.200: ................................................................ 6
http.downloaded_bytes: ......................................................... 4230
http.request_rate: ............................................................. 5/sec
http.requests: ................................................................. 50
http.response_time:
  min: ......................................................................... 9051
  max: ......................................................................... 9927
  median: ...................................................................... 9047.6
  p95: ......................................................................... 9230.4
  p99: ......................................................................... 9230.4
http.responses: ................................................................ 6
vusers.completed: .............................................................. 6
vusers.created: ................................................................ 50
vusers.created_by_name.Get meta: ............................................... 14
vusers.created_by_name.Get reviews: ............................................ 18
vusers.created_by_name.Get reviews for a product: .............................. 18
vusers.failed: ................................................................. 10
vusers.session_length:
  min: ......................................................................... 9091.1
  max: ......................................................................... 9944.7
  median: ...................................................................... 9047.6
  p95: ......................................................................... 9230.4
  p99: ......................................................................... 9230.4


All VUs finished. Total time: 31 seconds

--------------------------------
Summary report @ 20:00:18(-0400)
--------------------------------

errors.ETIMEDOUT: .............................................................. 94
http.codes.200: ................................................................ 6
http.downloaded_bytes: ......................................................... 4230
http.request_rate: ............................................................. 3/sec
http.requests: ................................................................. 100
http.response_time:
  min: ......................................................................... 9051
  max: ......................................................................... 9927
  median: ...................................................................... 9047.6
  p95: ......................................................................... 9230.4
  p99: ......................................................................... 9230.4
http.responses: ................................................................ 6
vusers.completed: .............................................................. 6
vusers.created: ................................................................ 100
vusers.created_by_name.Get meta: ............................................... 25
vusers.created_by_name.Get reviews: ............................................ 40
vusers.created_by_name.Get reviews for a product: .............................. 35
vusers.failed: ................................................................. 94
vusers.session_length:
  min: ......................................................................... 9091.1
  max: ......................................................................... 9944.7
  median: ...................................................................... 9047.6
  p95: ......................................................................... 9230.4
  p99: ......................................................................... 9230.4